package ua.zp.brainacademy;
   //5.Написать программу, которая выводит на экран каждое 3-е i-ое значение цикла.
public class Zad5 {
       public static void main(String[] args) {
           byte b = 0;
           while(b < 15){
               b += 3;
               System.out.println(b);
           }

       }
}
